pkwasniok/avr-db-template/lib/atpack/edc/AVR16DU20.PIC
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS9INCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xE82">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS9INSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xE83">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0xE84"/>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS10OUTCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xEC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS10OUTSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xEC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS10INCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xEC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS10INSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xEC3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0xEC4"/>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS11OUTCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF00">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0xF01">
          <edc:SelectSFR>
            <edc:SFRDef ltx:memberofperipheral="SYSCFG" edc:cname="REVID" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xF01"/>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS11OUTSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF01">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
                  <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS11INCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF02">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS11INSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF03">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0xF04"/>
        <edc:SFRDef ltx:memberofperipheral="SYSCFG" edc:cname="VUSBCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0xF06">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCFG">
              <edc:SFRFieldDef edc:cname="USBVREG" edc:nzwidth="0x1" edc:desc="USB Voltage Regulator">
                <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="USBVREG is disabled" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="USBVREG is enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x39" edc:_addr="0xF07"/>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS12OUTCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF40">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS12OUTSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF41">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS12INCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF42">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS12INSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF43">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
