pkwasniok/avr-db-template/lib/atpack/edc/AVR16DU20.PIC
        <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0xF44"/>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS13OUTCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF80">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS13OUTSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF81">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS13INCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF82">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS13INSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF83">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0xF84"/>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS14OUTCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xFC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS14OUTSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xFC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS14INCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xFC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS14INSET" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xFC3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
              <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0xFC4"/>
        <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x1000">
          <edc:SelectSFR>
            <edc:SFRDef ltx:memberofperipheral="NVMCTRL" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:_addr="0x1000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
                  <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x7" edc:desc="Command">
                    <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Command" edc:when="(field &amp; 0x7F) == 0x00"/>
                    <edc:SFRFieldSemantic edc:cname="NOOP" edc:desc="No Operation" edc:when="(field &amp; 0x7F) == 0x01"/>
                    <edc:SFRFieldSemantic edc:cname="FLWR" edc:desc="Flash Write" edc:when="(field &amp; 0x7F) == 0x02"/>
                    <edc:SFRFieldSemantic edc:cname="FLPER" edc:desc="Flash Page Erase" edc:when="(field &amp; 0x7F) == 0x08"/>
                    <edc:SFRFieldSemantic edc:cname="FLMPER2" edc:desc="Flash Multi-Page Erase 2 pages" edc:when="(field &amp; 0x7F) == 0x09"/>
                    <edc:SFRFieldSemantic edc:cname="FLMPER4" edc:desc="Flash Multi-Page Erase 4 pages" edc:when="(field &amp; 0x7F) == 0x0A"/>
                    <edc:SFRFieldSemantic edc:cname="FLMPER8" edc:desc="Flash Multi-Page Erase 8 pages" edc:when="(field &amp; 0x7F) == 0x0B"/>
                    <edc:SFRFieldSemantic edc:cname="FLMPER16" edc:desc="Flash Multi-Page Erase 16 pages" edc:when="(field &amp; 0x7F) == 0x0C"/>
                    <edc:SFRFieldSemantic edc:cname="FLMPER32" edc:desc="Flash Multi-Page Erase 32 pages" edc:when="(field &amp; 0x7F) == 0x0D"/>
                    <edc:SFRFieldSemantic edc:cname="EEWR" edc:desc="EEPROM Write" edc:when="(field &amp; 0x7F) == 0x12"/>
                    <edc:SFRFieldSemantic edc:cname="EEERWR" edc:desc="EEPROM Erase and Write" edc:when="(field &amp; 0x7F) == 0x13"/>
                    <edc:SFRFieldSemantic edc:cname="EEBER" edc:desc="EEPROM Byte Erase" edc:when="(field &amp; 0x7F) == 0x18"/>
                    <edc:SFRFieldSemantic edc:cname="EEMBER2" edc:desc="EEPROM Multi-Byte Erase 2 bytes" edc:when="(field &amp; 0x7F) == 0x19"/>
                    <edc:SFRFieldSemantic edc:cname="EEMBER4" edc:desc="EEPROM Multi-Byte Erase 4 bytes" edc:when="(field &amp; 0x7F) == 0x1A"/>
                    <edc:SFRFieldSemantic edc:cname="EEMBER8" edc:desc="EEPROM Multi-Byte Erase 8 bytes" edc:when="(field &amp; 0x7F) == 0x1B"/>
                    <edc:SFRFieldSemantic edc:cname="EEMBER16" edc:desc="EEPROM Multi-Byte Erase 16 bytes" edc:when="(field &amp; 0x7F) == 0x1C"/>
                    <edc:SFRFieldSemantic edc:cname="EEMBER32" edc:desc="EEPROM Multi-Byte Erase 32 bytes" edc:when="(field &amp; 0x7F) == 0x1D"/>
                    <edc:SFRFieldSemantic edc:cname="CHER" edc:desc="Chip Erase Command" edc:when="(field &amp; 0x7F) == 0x20"/>
                    <edc:SFRFieldSemantic edc:cname="EECHER" edc:desc="EEPROM Erase Command" edc:when="(field &amp; 0x7F) == 0x30"/>
                  </edc:SFRFieldDef>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
          <edc:SelectSFR>
            <edc:SFRDef ltx:memberofperipheral="USB0" edc:cname="STATUS15OUTCLR" edc:nzwidth="0x8" edc:access="wwwwwwww" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x1000">
              <edc:SFRModeList>
                <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USB0">
                  <edc:SFRFieldDef edc:cname="RMWSTATUS" edc:nzwidth="0x8" edc:desc="Read-Modify-Write Endpoint STATUS"/>
                </edc:SFRMode>
              </edc:SFRModeList>
            </edc:SFRDef>
          </edc:SelectSFR>
        </edc:MuxedSFRDef>
