pkwasniok/avr-db-template/lib/atpack/edc/AVR16DU20.PIC
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW242" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12F2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW243" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12F3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW244" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12F4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW245" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12F5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW246" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12F6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW247" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12F7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW248" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12F8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW249" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12F9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW250" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12FA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW251" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12FB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW252" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12FC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW253" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12FD"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW254" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12FE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW255" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x12FF"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW256" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1300"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW257" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1301"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW258" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1302"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW259" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1303"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW260" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1304"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW261" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1305"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW262" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1306"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW263" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1307"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW264" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1308"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW265" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1309"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW266" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW267" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW268" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW269" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW270" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW271" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x130F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW272" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1310"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW273" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1311"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW274" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1312"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW275" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1313"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW276" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1314"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW277" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1315"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW278" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1316"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW279" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1317"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW280" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1318"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW281" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1319"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW282" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW283" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW284" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW285" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW286" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW287" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x131F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW288" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1320"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW289" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1321"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW290" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1322"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW291" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1323"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW292" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1324"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW293" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1325"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW294" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1326"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW295" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1327"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW296" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1328"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW297" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1329"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW298" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x132A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW299" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x132B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW300" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x132C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW301" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x132D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW302" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x132E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW303" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x132F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW304" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1330"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW305" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1331"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW306" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1332"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW307" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1333"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW308" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1334"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW309" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1335"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW310" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1336"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW311" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1337"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW312" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1338"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW313" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1339"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW314" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x133A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW315" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x133B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW316" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x133C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW317" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x133D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW318" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x133E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW319" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x133F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW320" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1340"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW321" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1341"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW322" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1342"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW323" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1343"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW324" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1344"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW325" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1345"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW326" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1346"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW327" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1347"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW328" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1348"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW329" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1349"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW330" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x134A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW331" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x134B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW332" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x134C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW333" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x134D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW334" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x134E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW335" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x134F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW336" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1350"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW337" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1351"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW338" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1352"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW339" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1353"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW340" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1354"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW341" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1355"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW342" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1356"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW343" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1357"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW344" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1358"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW345" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1359"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW346" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x135A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW347" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x135B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW348" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x135C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW349" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x135D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW350" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x135E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW351" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x135F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW352" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1360"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW353" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1361"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW354" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1362"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW355" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1363"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW356" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1364"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW357" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1365"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW358" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1366"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW359" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1367"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW360" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1368"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW361" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1369"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW362" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x136A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW363" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x136B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW364" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x136C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW365" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x136D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW366" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x136E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW367" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x136F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW368" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1370"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW369" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1371"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW370" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1372"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW371" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1373"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW372" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1374"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW373" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1375"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW374" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1376"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW375" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1377"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW376" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1378"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW377" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1379"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW378" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x137A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW379" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x137B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW380" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x137C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW381" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x137D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW382" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x137E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW383" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x137F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW384" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1380"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW385" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1381"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW386" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1382"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW387" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1383"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW388" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1384"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW389" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1385"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW390" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1386"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW391" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1387"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW392" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1388"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW393" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1389"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW394" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x138A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW395" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x138B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW396" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x138C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW397" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x138D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW398" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x138E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW399" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x138F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW400" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1390"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW401" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1391"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW402" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1392"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW403" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1393"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW404" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1394"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW405" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1395"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW406" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1396"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW407" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1397"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW408" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1398"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW409" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1399"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW410" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x139A"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW411" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x139B"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW412" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x139C"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW413" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x139D"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW414" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x139E"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW415" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x139F"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW416" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13A0"/>
