pkwasniok/avr-db-template/lib/atpack/edc/AVR16DU20.PIC
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW417" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13A1"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW418" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13A2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW419" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13A3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW420" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13A4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW421" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13A5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW422" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13A6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW423" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13A7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW424" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13A8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW425" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13A9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW426" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13AA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW427" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13AB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW428" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13AC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW429" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13AD"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW430" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13AE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW431" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13AF"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW432" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13B0"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW433" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13B1"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW434" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13B2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW435" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13B3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW436" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13B4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW437" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13B5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW438" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13B6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW439" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13B7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW440" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13B8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW441" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13B9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW442" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13BA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW443" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13BB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW444" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13BC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW445" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13BD"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW446" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13BE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW447" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13BF"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW448" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13C0"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW449" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13C1"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW450" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13C2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW451" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13C3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW452" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13C4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW453" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13C5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW454" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13C6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW455" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13C7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW456" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13C8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW457" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13C9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW458" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13CA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW459" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13CB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW460" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13CC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW461" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13CD"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW462" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13CE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW463" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13CF"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW464" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13D0"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW465" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13D1"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW466" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13D2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW467" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13D3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW468" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13D4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW469" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13D5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW470" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13D6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW471" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13D7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW472" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13D8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW473" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13D9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW474" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13DA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW475" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13DB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW476" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13DC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW477" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13DD"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW478" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13DE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW479" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13DF"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW480" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13E0"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW481" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13E1"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW482" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13E2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW483" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13E3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW484" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13E4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW485" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13E5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW486" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13E6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW487" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13E7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW488" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13E8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW489" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13E9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW490" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13EA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW491" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13EB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW492" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13EC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW493" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13ED"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW494" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13EE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW495" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13EF"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW496" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13F0"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW497" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13F1"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW498" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13F2"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW499" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13F3"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW500" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13F4"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW501" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13F5"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW502" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13F6"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW503" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13F7"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW504" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13F8"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW505" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13F9"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW506" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13FA"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW507" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13FB"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW508" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13FC"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW509" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13FD"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW510" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13FE"/>
        <edc:SFRDef ltx:memberofperipheral="USERROW" edc:cname="USERROW511" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x13FF"/>
      </edc:UserIDSector>
      <edc:EEDataSector edc:regionid="EEPROM" edc:beginaddr="0x811400" edc:endaddr="0x811500" edc:magicoffset="0x810000" atdf:pagesize="0x1" edc:rw="rw"/>
      <edc:GPRDataSector edc:regionid="INTERNAL_SRAM" edc:beginaddr="0x7800" edc:endaddr="0x8000" edc:isexecutable="false" edc:rw="rw"/>
      <edc:GPRDataSector edc:regionid="MAPPED_PROGMEM" edc:beginaddr="0x8000" edc:endaddr="0xC000" atdf:pagesize="0x200" edc:isexecutable="false" edc:rw="rw"/>
    </edc:RegardlessOfMode>
    <edc:RegisterMap edc:id="TCA0/SINGLE">
      <edc:SFRDef ltx:memberofperipheral="TCA0" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="n---nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x8F" edc:addr="0xA00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Module Enable"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:nzwidth="0x3" edc:desc="Clock Selection">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="CLK_PER" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="CLK_PER / 2" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="CLK_PER / 4" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="CLK_PER / 8" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="CLK_PER / 16" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="CLK_PER / 64" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="CLK_PER / 256" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="CLK_PER / 1024" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
